Repository: xaistrying/water-tracker-app
Catalog: lib/app/l10n/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: Statistics
vi: Thống kê

# statistics_description
source: Your hydration insights
vi: Thông tin uống nước của bạn

source: Settings
vi: Cài đặt

# settings_description
source: Customize your experience
vi: Tùy chỉnh trải nghiệm của bạn

# dailyGoalText
source: of {value}{unit} daily goal
vi: trên {value}{unit} mục tiêu/ngày

# remaining
source: {value}{unit} remaining
vi: còn lại {value}{unit}

source: Custom
vi: Tùy chỉnh

source: Recent
vi: Gần đây

source: More
vi: Mở rộng

# no_water_intake_data
source: You haven't had any water yet.
vi: Bạn chưa uống chút nước nào hôm nay.

source: Day Streak
vi: Chuỗi Ngày

source: Weekly Avg
vi: TB Tuần

source: This Week
vi: Tuần Này

source: This Month
vi: Tháng Này

source: Mon
vi: T2

source: Tue
vi: T3

source: Wed
vi: T4

source: Thu
vi: T5

source: Fri
vi: T6

source: Sat
vi: T7

source: Sun
vi: CN

source: Goals Met
vi: Đạt Mục Tiêu

source: Success Rate
vi: Hoàn Thành

source: Daily Goal
vi: Mục tiêu mỗi ngày

source: Advanced Mode
vi: Chế độ nâng cao

# advanced_mode_description
source: Unlock goal to {value}{unit}
vi: Mở khóa mục tiêu lên {value}{unit}

# advanced_mode_dialog
source: Very high water intake goals should be discussed with a healthcare professional. Excessive water consumption can be harmful.
vi: Hãy hỏi ý kiến bác sĩ nếu đặt mục tiêu uống nước cao. Uống quá nhiều có thể gây hại đến sức khỏe.

source: Change Daily Goal
vi: Thay đổi mục tiêu mỗi ngày

source: Confirm
vi: Xác nhận

source: Cancel
vi: Hủy

# change_daily_goal_dialog
source: Are you sure you want to change your daily goal?
vi: Bạn có chắc muốn thay đổi mục tiêu mỗi ngày?

source: Appearance
vi: Giao diện

source: Dark Mode
vi: Chế độ tối

# dark_mode_description
source: Switch to dark theme
vi: Chuyển sang giao diện tối

source: Units
vi: Đơn vị

# units_description
source: Milliliters or fluuid ounces
vi: Mililít hoặc ounce

source: Language
vi: Ngôn ngữ

source: Reminders
vi: Nhắc nhở

source: Enable Reminders
vi: Bật nhắc nhở

# enable_reminders_description
source: Get notified to drink water
vi: Nhận thông báo uống nước

source: Sound Effects
vi: Âm thanh

# sound_effects_description
source: Play sound for actions
vi: Phát âm thanh khi nhắc nhở

source: Reminder Interval
vi: Khoảng cách nhắc nhở

source: Hydration Calculator
vi: Máy tính lượng nước

# hydration_calculator_description
source: Calculate your personalized daily water goal based on your body weight and activity level
vi: Tính toán mục tiêu uống nước hằng ngày của bạn dựa trên cân nặng và mức độ vận động

source: Body Weight
vi: Cân nặng

source: Daily Exercise Time
vi: Thời gian tập mỗi ngày

source: Recommended Daily Intake
vi: Lượng khuyến nghị mỗi ngày

# base
source: Base: {value} (based on body weight)
vi: Cơ bản: {value} (dựa trên cân nặng)

# exercise
source: Exercise: +{value} ({min} min activity)
vi: Tập luyện: +{value} (tập {min} phút)

source: Apply Recommended Goal
vi: Áp dụng mục tiêu khuyến nghị

# apply_recommended_goal_success_dialog
source: Your new daily goal will be set to {value}{unit}. Would you like to apply this change?
vi: Mục tiêu mới của bạn sẽ được đặt thành {value}{unit}. Bạn có muốn áp dụng thay đổi này không?

# apply_recommended_goal_failure_dialog
source: Your goal should be between {value1}{unit} and {value2}{unit}. Let's tweak it and try again!
vi: Mục tiêu nên nằm trong khoảng từ {value1}{unit} đến {value2}{unit}. Hãy điều chỉnh và thử lại nhé!

source: Invalid Goal Amount
vi: Mức mục tiêu không hợp lệ

source: Close
vi: Đóng

source: Quick Add Amounts
vi: Tùy chỉnh thêm nhanh

# quick_add_amounts_description
source: Customize your quick-add buttons for common drink sizes
vi: Thiết lập các nút thêm nhanh để ghi nhận lượng nước bạn thường uống.

source: Button
vi: Nút

source: Tip
vi: Mẹo

# quick_add_amounts_tip
source: Set these to your most common drink sizes (e.g., your favorite glass, water bottle, or mug capacity)
vi: Cài đặt các mức thêm nhanh theo dung tích thường dùng (ví dụ: ly, chai nước hoặc cốc bạn hay dùng).

source: Reset to Default Value
vi: Đặt lại về mặc định

# reset_quick_add_confirmation
source: This will reset your Quick-add buttons to their default values.
vi: Thao tác này sẽ đặt lại các nút thêm nhanh về giá trị mặc định.

# data_and_storage
source: Data & Storage
vi: Dữ liệu & Lưu trữ

# data_and_storage_description
source: Manage how your water intake data is stored and retained.
vi: Quản lý cách dữ liệu uống nước của bạn được lưu trữ và giữ lại.

source: Day
vi: Ngày

source: Week
vi: Tuần

source: Month
vi: Tháng

source: Storage Info
vi: Thông tin lưu trữ

# storage_info_content
source: Your data is stored locally on your device. Shorter retention periods help keep your app running smoothly.
vi: Dữ liệu của bạn được lưu trữ cục bộ trên thiết bị. Thời gian lưu giữ ngắn hơn giúp ứng dụng hoạt động mượt mà hơn.

# streakTitle0
source: No streak yet â€“ let's fix that!
vi: Hãy bắt đầu từ hôm nay!

# streakTitle1
source: First day streak!
vi: Chuỗi ngày đầu tiên!

# streakTitle2
source: {value} day streak!
vi: Chuỗi {value} ngày!

# streakContent0
source: Every habit starts with one small action.
vi: Mọi thói quen đều bắt đầu từ một hành động nhỏ.

# streakContent1
source: Great start! A journey begins with a single step.
vi: Khởi đầu tuyệt vời! Mỗi hành trình bắt đầu từ một bước đi.

# streakContent2
source: You're picking up steam. Small wins add up.
vi: Bạn đang dần tăng tốc. Những thành công nhỏ đang cộng dồn.

# streakContent3
source: Solid progress! You're forming a strong habit.
vi: Tiến bộ vững vàng! Bạn đang hình thành thói quen tốt.

# streakContent4
source: Impressive dedication. You're making this a lifestyle.
vi: Tinh thần kiên trì đáng nể. Bạn đang biến điều này thành lối sống.

# streakContent5
source: You're a force of habit! This is how change happens.
vi: Bạn thật sự có thói quen mạnh mẽ! Đây chính là cách thay đổi xảy ra.

# streakContent6
source: Legendary commitment. You're an inspiration.
vi: Cam kết đáng khâm phục. Bạn là nguồn cảm hứng cho người khác.

# streakAction0
source: Take the first step
vi: Bắt đầu bước đầu tiên

# streakAction1
source: Keep the momentum going
vi: Giữ vững đà tiến

# streakAction2
source: Stay on track
vi: Tiếp tục đúng hướng

# streakAction3
source: Don't lose your rhythm
vi: Đừng đánh mất nhịp độ

# streakAction4
source: Keep pushing forward
vi: Tiếp tục tiến về phía trước

# streakAction5
source: Inspire others
vi: Truyền cảm hứng cho người khác

# streakAction6
source: Be proud and keep going
vi: Tự hào và tiếp tục cố gắng

# achievementTitle0
source: Let's begin!
vi: Bắt đầu thôi!

# achievementTitle1
source: Off to a start!
vi: Khởi đầu rồi!

# achievementTitle2
source: Making progress!
vi: Đang tiến triển tốt!

# achievementTitle3
source: Over halfway!
vi: Hơn nửa chặng đường!

# achievementTitle4
source: Almost there!
vi: Sắp hoàn thành!

# achievementTitle5
source: Goal achieved!
vi: Đã hoàn thành mục tiêu!

# achievementContent0
source: You haven't started yet, but there's still time to crush your goal.
vi: Bạn chưa bắt đầu, nhưng vẫn còn thời gian để chinh phục mục tiêu.

# achievementContent1
source: You're {value}% towards your daily goal. Every bit counts!
vi: Bạn đã đạt {value}% mục tiêu hôm nay. Mỗi bước đều quan trọng!

# achievementContent2
source: You're {value}% there. Stay focused and keep moving!
vi: Bạn đã hoàn thành {value}% chặng đường. Giữ vững tinh thần nhé!

# achievementContent3
source: You're {value}% towards your goal. Great effort so far!
vi: Bạn đã đạt {value}% mục tiêu. Cố gắng tuyệt vời cho đến nay!

# achievementContent4
source: You're {value}% in! One last push to reach your goal.
vi: Bạn đã hoàn thành {value}%. Chỉ còn chút nữa là đạt mục tiêu!

# achievementContent5
source: You hit 100% of your daily goal. Amazing work!
vi: Bạn đã đạt 100% mục tiêu hôm nay. Làm rất tốt!

# achievementAction0
source: Take the first step
vi: Bắt đầu ngay

# achievementAction1
source: Keep it going
vi: Tiếp tục nhé

# achievementAction2
source: You're halfway there
vi: Đã đi được nửa đường

# achievementAction3
source: Push a little more
vi: Cố thêm chút nữa

# achievementAction4
source: Finish strong
vi: Kết thúc thật mạnh mẽ

# achievementAction5
source: Celebrate your win
vi: Chúc mừng thành công

# benefitTitle
source: How water helps?
vi: Nước mang lại lợi ích gì?

# benefitAction
source: Keep the good work going!
vi: Tiếp tục duy trì thói quen tốt nhé!

# benefit0
source: Water is helping flush toxins from your kidneys and keeping your skin glowing.
vi: Nước giúp thải độc qua thận và giữ cho làn da bạn luôn rạng rỡ.

# benefit1
source: Hydration is supporting your joints and reducing fatigue.
vi: Cơ thể được cấp nước giúp hỗ trợ khớp và giảm mệt mỏi.

# benefit2
source: You're maintaining focus and mental clarity by staying hydrated.
vi: Bạn đang duy trì sự tập trung và minh mẫn nhờ uống đủ nước.

# benefit3
source: You're supporting healthy skin, mood, and overall well-being right now.
vi: Bạn đang chăm sóc làn da, tâm trạng và sức khỏe tổng thể của mình.

# benefit4
source: Your heart is working more efficiently thanks to proper hydration.
vi: Tim bạn hoạt động hiệu quả hơn khi được cung cấp đủ nước.

# benefit5
source: You're helping your whole body feel better just by staying hydrated.
vi: Chỉ cần uống đủ nước, cơ thể bạn sẽ cảm thấy dễ chịu hơn rất nhiều.

# factTitle
source: Did you know?
vi: Bạn có biết?

# factAction
source: Keep the good work going!
vi: Tiếp tục duy trì thói quen tốt nhé!

# fact0
source: Your body is about 60% water, vital for nearly every function.
vi: Cơ thể bạn chứa khoảng 60% nước - yếu tố quan trọng cho hầu hết chức năng sống.

# fact1
source: Your brain is 75% water. Even mild dehydration can affect concentration and mood.
vi: Não bộ có đến 75% là nước. Thiếu nước nhẹ cũng có thể ảnh hưởng đến sự tập trung và tâm trạng.

# fact2
source: You can live for weeks without food, but only days without water.
vi: Bạn có thể sống nhiều tuần không ăn, nhưng chỉ vài ngày nếu không uống nước.

# fact3
source: Hydration helps regulate your body temperature and prevent headaches.
vi: Uống đủ nước giúp điều hòa thân nhiệt và ngăn ngừa đau đầu.

# fact4
source: Hydration improves circulation and supports a healthy immune system.
vi: Cấp nước đầy đủ cải thiện tuần hoàn máu và tăng cường hệ miễn dịch.

# fact5
source: Drinking water helps cushion your joints and muscles during activity.
vi: Nước giúp bảo vệ khớp và cơ bắp khi vận động.

# fact6
source: Staying hydrated helps your brain work better, improving focus and memory.
vi: Uống đủ nước giúp não hoạt động tốt hơn, tăng khả năng tập trung và ghi nhớ.

# fact7
source: Water is aiding digestion and supporting your metabolism.
vi: Nước hỗ trợ tiêu hóa và thúc đẩy quá trình trao đổi chất.

# fact8
source: Water is helping deliver nutrients to your cells and boosting energy.
vi: Nước giúp vận chuyển dưỡng chất đến tế bào và tăng cường năng lượng.
